emacs/org-mode/README.org
* How to use Emacs org-mode?

** How to export an org file to markdown file?

Use =org-md-export-to-markdown= command to export to a text file with Markdown syntax.

** How to export org file to markdown by shell ?

Use =emacs input.org --batch -f org-md-export-to-markdown -f save-buffer=  command to export an org file to markdown

** How to use makefile to export org file to markdown?

#+begin_src makefile
output.md: input.org
    emacs $< --batch -f org-md-export-to-markdown -f save-buffer

.PHONY: clean
clean:
    rm -f output.md
#+end_src

** How to convert multiple org files to markdown?

#+begin_src makefile
ORG_FILES := $(wildcard *.org)
MD_FILES := $(patsubst %.org,%.md,$(ORG_FILES))

all: $(MD_FILES)

%.md: %.org
    emacs $< --batch -f org-md-export-to-markdown -f save-buffer

.PHONY: clean
clean:
    rm -f $(MD_FILES)
#+end_src

** How to convert multiple org files which located under current directory to markdown ?

如何用 makefile 將當前目錄下的子目錄下的多個 org file 轉換 成多個 markdown 使用 `emacs input.org --batch -f org-md-export-to-markdown -f save-buffer`指令?

#+begin_src makefile
ORG_FILES := $(shell find . -name '*.org')
MD_FILES := $(patsubst %.org,%.md,$(ORG_FILES))

all: $(MD_FILES)

%.md: %.org
    emacs $< --batch -f org-md-export-to-markdown -f save-buffer

.PHONY: clean
clean:
    rm -f $(MD_FILES)
#+end_src

** org-mode如何產生類似 markdown `` 標記

使用 =test= 可以生成類似 markdown `test` 









